In [2]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\esteban.vergara\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd

In [4]:
data = {
    'Name' : ['Sarah', 'Sandra', 'Nekotina', 'Nekotina', 'Nekotina', 'Nekotina'],
    'Age': [20, 30, 666, 10, 10, 777]
}

data

{'Name': ['Sarah', 'Sandra', 'Nekotina', 'Nekotina', 'Nekotina', 'Nekotina'],
 'Age': [20, 30, 666, 10, 10, 777]}

In [5]:
df = pd.DataFrame(data)
df

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
4  Nekotina   10
5  Nekotina  777

# Basic Filters

In [6]:
# series (they're like lists):

df["Age"]

0     20
1     30
2    666
3     10
4     10
5    777
Name: Age, dtype: int64

In [7]:
df["Name"]

0       Sarah
1      Sandra
2    Nekotina
3    Nekotina
4    Nekotina
5    Nekotina
Name: Name, dtype: object

In [8]:
# los filtros tienen una sintaxis muy inusual!
# te da los que cumplen, pero solo en la columna usada. el resultado es una serie

df["Age"] > 20

0    False
1     True
2     True
3    False
4    False
5     True
Name: Age, dtype: bool

In [9]:
# entonces pues lo guardas, y lo puedes usar
# al meter el filtro guardado en el dataframe, el resultado booleano se mete en "mostrar???"
# y se muestran todos los datos de los que salieron true en el filtro

mayores_japon = df["Age"] > 20

df[mayores_japon]

       Name  Age
1    Sandra   30
2  Nekotina  666
5  Nekotina  777

# Basic GroupBy

In [10]:
# agrupemos las nekotinas repetidas, pero qué hacemos con sus edades?
# pues las promediamos
# otros enums son 'max', 'min', y así

df.groupby("Name").agg(
    {
        'Age': 'mean'
    }
)

             Age
Name
Nekotina  365.75
Sandra     30.00
Sarah      20.00

In [11]:
# en los groupby, el parámetro queda como índice!

max_edades = df.groupby("Name").agg(
    {
        'Age': 'max'
    }
)

max_edades

          Age
Name
Nekotina  777
Sandra     30
Sarah      20

In [12]:
print(df.index)             # index rango numérico
print(max_edades.index)     # index nombres del groupby

RangeIndex(start=0, stop=6, step=1)
Index(['Nekotina', 'Sandra', 'Sarah'], dtype='object', name='Name')

In [13]:
# pero puedes resetear ese index para que vuelvan a ser números
# aunque se perderán entradas del df original, en este caso sólo quedaron los mayores

max_edades.reset_index()

       Name  Age
0  Nekotina  777
1    Sandra   30
2     Sarah   20

# Drop

In [14]:
# puedes borrar las entradas EXACTAMENTE IGUALES con drop_duplicates()
# eliminamos la segunda nekotina de 10 años
# aunque mira que quedaron los index viejos

df.drop_duplicates()

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
5  Nekotina  777

In [15]:
# si los reinicias, hay una columna con los viejos

df.drop_duplicates().reset_index()

   index      Name  Age
0      0     Sarah   20
1      1    Sandra   30
2      2  Nekotina  666
3      3  Nekotina   10
4      5  Nekotina  777

In [16]:
# puedes borrar esa columna
# (nada de esto sobreescribe, menos mal. Tienes que hacer el df = ...  para eso)

df.drop_duplicates().reset_index(drop = True)

       Name  Age
0     Sarah   20
1    Sandra   30
2  Nekotina  666
3  Nekotina   10
4  Nekotina  777

In [17]:
# y agregar otra columna

df["Gender"] = ['Woman', 'Man', 'Woman', 'Man', 'Man', "Woman"]
df

       Name  Age Gender
0     Sarah   20  Woman
1    Sandra   30    Man
2  Nekotina  666  Woman
3  Nekotina   10    Man
4  Nekotina   10    Man
5  Nekotina  777  Woman

In [26]:
# agarrando filas

selection = df[2:3] # simplemente 2, es raro que no se pueda poner [2]
subset = df[1:3]

# Creating a Series:

In [27]:
# Creating a Series from a list
ages = pd.Series([25, 28, 22], name='Age')
        
# Accessing elements by index
first_age = ages[0]
 
# Applying a function to each element
ages_in_months = ages.apply(lambda x: x * 12)

# Null filtering

Filtering Null (NaN) Values:
Handling missing data is a crucial aspect of data analysis. Pandas provides methods to filter and handle null values effectively:

isnull() and notnull() Methods: Identify and filter null or non-null values.

dropna() Method: Remove rows or columns containing null values.

fillna() Method: Replace null values with a specified value or strategy.

In [30]:
# Filtering rows with null values in the 'Salary' column

df2 = pd.DataFrame({
    'Id' : [1,22,342,55],
    'Salary' :  [10101, 222, None, 10]
})

non_null_salaries = df2[df2['Salary'].notnull()]

non_null_salaries

   Id   Salary
0   1  10101.0
1  22    222.0
3  55     10.0

# GroupBy

In [ ]:
import pandas as pd
 
# Creating a DataFrame
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Subcategory' : ['a', 'a', 'b', 'a', 'b', 'b'],
        'Value': [10, 15, 20, 25, 30, 35],
        'OtherValue': reversed([10, 15, 20, 25, 30, 35])
        }
 
df = pd.DataFrame(data)
 
# Grouping by 'Category'
grouped = df.groupby('Category')

grouped # imposible de ver, qué se hace con los valores de los grupos??? (lo que sigue)

# Aggregation Functions:
Aggregation functions in Pandas allow you to perform calculations on the grouped data, producing summary statistics for each group. Common aggregation functions include:

`Sum`: Calculates the sum of values in each group.

`Mean`: Computes the mean (average) of values in each group.

`Max` and Min: Finds the maximum and minimum values in each group.

`Count`: Counts the number of occurrences in each group.

`Custom Aggregations:` You can define and apply custom aggregation functions to meet specific analysis requirements.

In [ ]:
# remember,
# grouped = df.groupby('Category')

# Applying aggregation functions
sum_values = grouped['Value'].sum()
average_values = grouped['Value'].mean()
max_values = grouped['Value'].max()
min_values = grouped['Value'].min()
count_values = grouped['Value'].count()

count_values

Category
A    3
B    3
Name: Value, dtype: int64

In [ ]:
# es diferente a esta sintaxis...

# remember,
# grouped = df.groupby('Category')

count_values_2 = grouped.agg({'Value':'count'})

count_values_2

          Value
Category
A             3
B             3

# Advanced GroupBy Operations:
GroupBy in Pandas supports more advanced operations, including:

Grouping by Multiple Columns: You can group by multiple columns, creating a hierarchical index.

Applying Multiple Aggregation Functions: It's possible to apply multiple aggregation functions simultaneously.

Filtering Groups: You can filter groups based on certain conditions.

Let's explore an example that demonstrates some of these advanced GroupBy operations:

In [ ]:
# Grouping by multiple columns
grouped_multiple = df.groupby(['Category', 'Subcategory'])
 
# Applying multiple aggregation functions
result = grouped_multiple.agg({'Value': ['sum', 'mean'], 'OtherValue': 'max'})

# Here, we are grouping by both 'Category' and 'Subcategory' columns and applying different aggregation functions to each.
# agrupa por uno 

result

                     Value       OtherValue
                       sum  mean        max
Category Subcategory
A        a              10  10.0         35
         b              50  25.0         25
B        a              40  20.0         30
         b              35  35.0         10